---
kind: property
id: P:Autodesk.Revit.DB.ViewOrientation3D.EyePosition
source: html/7bef48d3-de78-1b04-5226-619faba2249b.htm
---
# Autodesk.Revit.DB.ViewOrientation3D.EyePosition Property

The eye position point

## Syntax (C#)
```csharp
public XYZ EyePosition { get; }
```